app/views/courses/_form.html.erb

    <%= form.label :bacth %><br>
    <%= form.collection_select :batch_id, Batch.all,:id,:name ,{}, class: "form-control"%>
---
SELECT "batches".* FROM "batches"