app/controllers/batches_controller.rb

INSERT INTO "batches" ("max_count", "name", "school_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["max_count", 1000], ["name", "name"], ["school_id", 5], ["created_at", "2023-03-04 06:09:10.784086"], ["updated_at", "2023-03-04 06:09:10.784086"]]
---
  def create
    @batch = Batch.new(batch_params)
    respond_to do |format|
      if @batch.save

DELETE FROM "batches" WHERE "batches"."id" = $1  [["id", 2]]
---
  def destroy
    @batch.destroy

SELECT "batches".* FROM "batches" WHERE "batches"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_batch
    @batch = Batch.find(params[:id])