app/controllers/connections_controller.rb

DELETE FROM "connections" WHERE "connections"."id" = $1  [["id", 1]]
---
  def destroy
    @connection.destroy

SELECT "connections".* FROM "connections" WHERE "connections"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_connection
    @connection = Connection.find(params[:id])