app/controllers/courses_controller.rb

SELECT "courses".* FROM "courses" WHERE (name LIKE '%test%' or sub_name LIKE '%test%')
---
  def index
    @courses = Course.all

INSERT INTO "courses" ("name", "sub_name", "start_at", "end_at", "fees", "tutor_name", "course_duration", "description", "batch_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
  def create
    @course = Course.new(course_params)
    respond_to do |format|
      if @course.save

UPDATE "courses" SET "start_at" = $1, "end_at" = $2, "updated_at" = $3 WHERE "courses"."id" = $4  [["start_at", "13:41:55.873000"], ["end_at", "14:41:55.873000"], ["updated_at", "2023-03-02 15:40:20.553639"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @course.update(course_params)

DELETE FROM "courses" WHERE "courses"."id" = $1  [["id", 10]]
---
  def destroy
    @course.destroy