app/controllers/dashboards_controller.rb

INSERT INTO "users" ("email", "encrypted_password", "role", "first_name", "last_name", "reset_password_token", "reset_password_sent_at", "remember_created_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    @school_admin = User.find_or_create_by(user_params)

UPDATE "users" SET "encrypted_password" = $1, "first_name" = $2, "last_name" = $3, "updated_at" = $4 WHERE "users"."id" = $5  [["encrypted_password", "[FILTERED]"], ["first_name", "test school admin"], ["last_name", "name"], ["updated_at", "2023-03-04 07:02:31.386304"], ["id", 11]]
---
  def update
    respond_to do |format|
      if @school_admin.update(user_params)

DELETE FROM "schools" WHERE "schools"."id" = $1  [["id", 1]]
---
  def destroy
    @school_admin.destroy

INSERT INTO "connections" ("student_id", "course_id", "batch_id", "school_id", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["student_id", 5], ["course_id", 10], ["batch_id", 4], ["school_id", 2], ["status", false], ["created_at", "2023-03-04 06:39:14.387459"], ["updated_at", "2023-03-04 06:39:14.387459"]]
SELECT "batches".* FROM "batches" WHERE "batches"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT "connections".* FROM "connections" WHERE "connections"."course_id" = $1 AND "connections"."student_id" = $2 AND "connections"."school_id" = $3 AND "connections"."batch_id" = $4 LIMIT $5  [["course_id", 10], ["student_id", 5], ["school_id", 2], ["batch_id", 4], ["LIMIT", 1]]
SELECT "schools".* FROM "schools" WHERE "schools"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def add_request
    respond_to do |format|
      if @course.connections.find_or_create_by!(student_id: current_user&.id, school_id: @course&.batch&.school&.id,
                                                batch_id: @course&.batch&.id)

SELECT "connections".* FROM "connections" WHERE "connections"."student_id" = $1 AND "connections"."student_id" = $2  [["student_id", 3], ["student_id", 3]]
---
  def request_review
    @request_review = if current_user.student?
                        current_user.connections.student_connection(current_user&.id)
                      elsif current_user.school_admin?
                        Connection.school_admin_connection(current_user.own_school&.id)
                      else
                        Connection.all.includes(%i[course batch student school])

SELECT "batches".* FROM "batches" WHERE "batches"."school_id" = $1  [["school_id", 1]]
SELECT "schools".* FROM "schools" WHERE "schools"."id" IN ($1, $2)  [["id", 1], ["id", 5]]
---
  def list_batch
    @list_batch = if current_user.student?
                    current_user.batches.student_batch
                  elsif current_user.school_admin?
                    Batch.school_admin_batch(current_user.own_school&.id)
                  else
                    Batch.all.includes(:school)

SELECT "schools".* FROM "schools" WHERE "schools"."owner_id" = $1 LIMIT $2  [["owner_id", 5], ["LIMIT", 1]]
---
  def list_school
    if current_user.student?
      @list_schools = current_user.schools.student_school
    elsif current_user.school_admin?
      @school = current_user.own_school
    else
      @list_schools = School.all.includes(:owner)

SELECT "users".* FROM "users" WHERE "users"."role" = $1  [["role", 1]]
---
  def list_school_admin
    @list_school_admins = User.where(role: 1)

UPDATE "connections" SET "status" = $1, "updated_at" = $2 WHERE "connections"."id" = $3  [["status", true], ["updated_at", "2023-03-04 07:13:11.780620"], ["id", 21]]
---
  def approve_request
    respond_to do |format|
      if @connection.update(status: true)

SELECT "connections".* FROM "connections" WHERE "connections"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]
---
  def set_connection
    @connection = Connection.find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def set_user
    @school_admin = User.find(params[:id])