app/controllers/schools_controller.rb

INSERT INTO "schools" ("name", "address", "owner_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "new Test School"], ["address", "nagpur"], ["owner_id", 5], ["created_at", "2023-03-04 05:04:43.358548"], ["updated_at", "2023-03-04 05:04:43.358548"]]
---
  def create
    @school = School.new(school_params)
    respond_to do |format|
      if @school.save

DELETE FROM "schools" WHERE "schools"."id" = $1  [["id", 5]]
---
  def destroy
    @school.destroy

SELECT "schools".* FROM "schools" WHERE "schools"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def set_school
    @school = School.find(params[:id])