app/models/connection.rb

SELECT "connections".* FROM "connections" WHERE "connections"."student_id" = $1 AND "connections"."course_id" = $2 LIMIT $3  [["student_id", 10], ["course_id", 11], ["LIMIT", 1]]
---
  scope :student_connection, lambda { |student_id|
                               includes(%i[course batch student school]).where(student_id:)